# IFCExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExportOptions Constructor
IFCExportOptions Class See Also
---
Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IFCExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCExportOptions()
```

# See Also
IFCExportOptions Class
IFCExportOptions Overload
Autodesk.Revit.DB Namespace